#Tool by cyber king
#otp bypass normal

import os
import random

p = '\x1b[0m'
m = '\x1b[91m'
h = '\x1b[92m'
k = '\x1b[93m'
b = '\x1b[94m'
u = '\x1b[95m'
bm = '\x1b[96m'
bgm = '\x1b[41m'
bgp = '\x1b[47m'
res = '\x1b[40m'

os.system ('clear')

def start():
    x =int(input(m+"[×] enter your phone number : "))
    y = random.randint(0,999999)
    print("━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━━")
    print (y)
    print ("━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━")


def cyber():
    os.system ('xdg-open https://api.whatsapp.com/send?phone=94717804134')
def githu():
    os.system ('xdg-open https://github.com/Cyberking12346')    
    

def banner():
    print(m+"         █████╗ ████████╗██████╗")
    print(m+"        ██╔══██╗╚══██╔══╝██╔══██╗")
    print(m+"        ██║  ██║    ██║   ██████╔╝")
    print(m+"        ██║  ██║    ██║   ██╔═══╝")
    print(m+"        ╚█████╔╝    ██║   ██║")   
    print(m+"         ╚════╝     ╚═╝   ╚═╝") 


    print(k+"██████╗ ██╗   ██╗██████╗  █████╗   ██████╗")
    print(k+"██╔══██╗╚██╗ ██╔╝██╔══██╗██╔══██╗██╔════╝")
    print(k+"██████╦╝ ╚████╔╝ ██████╔╝███████║╚█████╗")
    print(k+"██╔══██╗  ╚██╔╝  ██╔═══╝ ██╔══██║ ╚═══██╗")
    print(k+"██████╦╝    ██║  ██║      ██║  ██║██████╔╝")
    print(k+"╚═════╝     ╚═╝  ╚═╝      ╚═╝  ╚═╝╚═════╝")
    print("") 
    print(b+"╭══• ೋ•✧๑♡๑✧•ೋ •══╮═• ೋ•✧๑♡๑✧•ೋ •═══• ೋ•✧๑♡๑✧•ೋ •══")
    print(b+"╰══• ೋ•✧๑♡๑✧•ೋ •══╯═• ೋ•✧๑♡๑✧•ೋ •═══• ೋ•✧๑♡๑✧•ೋ •══")
    print("")
    print(b+"              __𝗧𝗢𝗢𝗟 𝗕𝗬 𝗖𝗬𝗕𝗘𝗥 𝗞𝗜𝗡𝗚__")
    print("")
    print(bm+"         [1] start :")
    print(bm+"         [2] contact cyber king :")
    print(bm+"         [3] github my tool :")
    print("")
    print("✩｡:*•.─────  ❁ ❁  ─────.•*:｡✩✩｡:*•.─────  ❁ ❁  ─────.•*:｡✩✩｡:*•")
   
    choice=int(input(k+"enter your choice  : "))
    print ("★━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━━━━━━★★━━━━━━━━━━━★")


    if choice == 1:
        start()
    elif choice ==2:
        cyber()
    elif choice ==3:
        githup()
    else:
        print("____no choice____🤨🤨")
banner()        